Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    Для Каждого Строка Из Товары Цикл
        Строка.Сумма = Строка.Количество * Строка.Цена;
    КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    Если ЗначениеЗаполнено(Заказ) Тогда
        ЗапросДубля = Новый Запрос;
        ЗапросДубля.Текст =
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |    Поступление.Ссылка КАК Ссылка
        |ИЗ
        |    Документ.ПоступлениеТоваров КАК Поступление
        |ГДЕ
        |    Поступление.Заказ = &Заказ
        |    И Поступление.Проведен
        |    И Поступление.Ссылка <> &ТекущаяСсылка";
        ЗапросДубля.УстановитьПараметр("Заказ", Заказ);
        ЗапросДубля.УстановитьПараметр("ТекущаяСсылка", Ссылка);

        Если Не ЗапросДубля.Выполнить().Пустой() Тогда
            ВызватьИсключение "По этому заказу поставщику уже есть проведённое поступление.";
        КонецЕсли;
    КонецЕсли;

    Движения.ОстаткиТоваров.Записывать = Истина;

    Для Каждого Строка Из Товары Цикл
        Движение = Движения.ОстаткиТоваров.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = Дата;
        Движение.Номенклатура = Строка.Номенклатура;
        Движение.Склады = Склады;
        Движение.Количество = Строка.Количество;
    КонецЦикла;

    Движения.Взаиморасчеты.Записывать = Истина;
    ДвижениеРасчетов = Движения.Взаиморасчеты.Добавить();
    ДвижениеРасчетов.ВидДвижения = ВидДвиженияНакопления.Расход;
    ДвижениеРасчетов.Период = Дата;
    ДвижениеРасчетов.Контрагент = Поставщик;
    ДвижениеРасчетов.Сумма = Товары.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Поставщик = ДанныеЗаполнения.Поставщик;
		Склады = ДанныеЗаполнения.Склад;
		Заказ = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
