
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
    СтрокаТаблицы.Цена = ПолучитьЦенуЗакупки(СтрокаТаблицы.Номенклатура);
    ПересчитатьСтроку(СтрокаТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчитатьСтроку(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьСтроку(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтроку(СтрокаТаблицы)
    СтрокаТаблицы.Сумма = СтрокаТаблицы.Количество * СтрокаТаблицы.Цена;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуЗакупки(Номенклатура)
    Возврат Номенклатура.ЦенаЗакупки;
КонецФункции